Merafour/libstm32/STM32F4xx/Inc/main.h
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H__
#define __MAIN_H__

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_ll_adc.h"
#include "stm32f4xx.h"
#include "stm32f4xx_ll_i2c.h"
#include "stm32f4xx_ll_iwdg.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx_ll_usart.h"
#include "stm32f4xx_ll_wwdg.h"
#include "stm32f4xx_ll_gpio.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private define ------------------------------------------------------------*/

#define ARM_RUN_Pin LL_GPIO_PIN_2
#define ARM_RUN_GPIO_Port GPIOE
#define ARM_LED4_Pin LL_GPIO_PIN_3
#define ARM_LED4_GPIO_Port GPIOE
#define ARM_LED1_Pin LL_GPIO_PIN_4
#define ARM_LED1_GPIO_Port GPIOE
#define ARM_LED2_Pin LL_GPIO_PIN_5
#define ARM_LED2_GPIO_Port GPIOE
#define ARM_LED3_Pin LL_GPIO_PIN_6
#define ARM_LED3_GPIO_Port GPIOE
#define ADC_IN0_Pin LL_GPIO_PIN_5
#define ADC_IN0_GPIO_Port GPIOA
#define ADC_IN1_Pin LL_GPIO_PIN_6
#define ADC_IN1_GPIO_Port GPIOA
#define ADC_IN2_Pin LL_GPIO_PIN_7
#define ADC_IN2_GPIO_Port GPIOA
#define ADC_IN3_Pin LL_GPIO_PIN_4
#define ADC_IN3_GPIO_Port GPIOC
#define ADC_IN4_Pin LL_GPIO_PIN_5
#define ADC_IN4_GPIO_Port GPIOC
#define ADC_IN5_Pin LL_GPIO_PIN_0
#define ADC_IN5_GPIO_Port GPIOB
#define IPMB_A_EN_Pin LL_GPIO_PIN_7
#define IPMB_A_EN_GPIO_Port GPIOE
#define IPMB_B_EN_Pin LL_GPIO_PIN_8
#define IPMB_B_EN_GPIO_Port GPIOE
#define IPMB_A_READY_Pin LL_GPIO_PIN_9
#define IPMB_A_READY_GPIO_Port GPIOE
#define IPMB_B_READY_Pin LL_GPIO_PIN_10
#define IPMB_B_READY_GPIO_Port GPIOE
#define LED2_ALARM_Pin LL_GPIO_PIN_12
#define LED2_ALARM_GPIO_Port GPIOB
#define LED1_ALARM_Pin LL_GPIO_PIN_13
#define LED1_ALARM_GPIO_Port GPIOB
#define GA0_Pin LL_GPIO_PIN_0
#define GA0_GPIO_Port GPIOD
#define GA1_Pin LL_GPIO_PIN_1
#define GA1_GPIO_Port GPIOD
#define GA2_Pin LL_GPIO_PIN_2
#define GA2_GPIO_Port GPIOD
#define GA3_Pin LL_GPIO_PIN_3
#define GA3_GPIO_Port GPIOD
#define GA4_Pin LL_GPIO_PIN_4
#define GA4_GPIO_Port GPIOD
#define GAP_Pin LL_GPIO_PIN_5
#define GAP_GPIO_Port GPIOD

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
 extern "C" {
#endif
void _Error_Handler(char *, int);

#define Error_Handler() _Error_Handler(__FILE__, __LINE__)
#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H__ */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
